---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.FindGenericConnectionType(Autodesk.Revit.DB.Document)
source: html/83298a62-78c9-8182-f742-a4aeff747bec.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.FindGenericConnectionType Method

Finds StructuralConnectionHandlerType which is Generic Connection type.

## Syntax (C#)
```csharp
public static ElementId FindGenericConnectionType(
	Document doc
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`)

## Returns
Returns id of StructuralConnectionHandlerType which is Generic Connection type of invalidElementId if not found.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null